Catalogs/ВидыСостоянийДокументовВСВД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>ВидыСостоянийДокументовВСВД</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НомерКартинкиВКоллекции</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Позиция</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ВидыСостоянийДокументовВСВД/Ext/ManagerModule.bsl
Функция ПолучитьДанныеДляВыводаСостояний() Экспорт
	
	СписокСостояний = Новый СписокЗначений;
	Выборка = Справочники.ВидыСостоянийДокументовВСВД.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Результат = РаботаССВДПереопределяемый.ПолучитьДанныеДляВыводаСостояния(Выборка.Ссылка);
		Если ТипЗнч(Результат) = Тип("Структура") Тогда
			СписокСостояний.Добавить(Результат, Формат(Результат.Позиция, "ЧЦ=4; ЧВН="));
			Продолжить;
		КонецЕсли;	
		
		Результат = Новый Структура;
		Результат.Вставить("Состояние", Выборка.Ссылка);
		Результат.Вставить("Позиция", Выборка.Позиция);
		Результат.Вставить("НомерВКоллекции", Выборка.НомерКартинкиВКоллекции);
		
		Если Результат <> Неопределено И Результат.Свойство("Позиция") Тогда
			СписокСостояний.Добавить(Результат, Формат(Результат.Позиция, "ЧЦ=4; ЧВН="));
		КонецЕсли;
	КонецЦикла;
	
	СписокСостояний.СортироватьПоПредставлению();
		
	Возврат СписокСостояний;
	
КонецФункции
